zzzmomo-code/electric-sai-stm32-measurement/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BUSY_Pin GPIO_PIN_0
#define BUSY_GPIO_Port GPIOC
#define CS_Pin GPIO_PIN_1
#define CS_GPIO_Port GPIOC
#define PS_PWM_Pin GPIO_PIN_13
#define PS_PWM_GPIO_Port GPIOE
#define DDS_FSYNC_Pin GPIO_PIN_12
#define DDS_FSYNC_GPIO_Port GPIOB
#define FS_Pin GPIO_PIN_14
#define FS_GPIO_Port GPIOB
#define PS_Pin GPIO_PIN_8
#define PS_GPIO_Port GPIOD
#define DDS_RST_Pin GPIO_PIN_9
#define DDS_RST_GPIO_Port GPIOD
#define relay3_Pin GPIO_PIN_12
#define relay3_GPIO_Port GPIOD
#define relay_1_Pin GPIO_PIN_13
#define relay_1_GPIO_Port GPIOD
#define relay_2_Pin GPIO_PIN_14
#define relay_2_GPIO_Port GPIOD
#define relay_4_Pin GPIO_PIN_6
#define relay_4_GPIO_Port GPIOC
#define FS_PWM_Pin GPIO_PIN_11
#define FS_PWM_GPIO_Port GPIOA
#define ADS8688_DAISY_Pin GPIO_PIN_0
#define ADS8688_DAISY_GPIO_Port GPIOD
#define ADS8688_RST_Pin GPIO_PIN_1
#define ADS8688_RST_GPIO_Port GPIOD
#define AD9959_IO_UPDATE_Pin GPIO_PIN_4
#define AD9959_IO_UPDATE_GPIO_Port GPIOD
#define AD9959_CS_Pin GPIO_PIN_5
#define AD9959_CS_GPIO_Port GPIOD
#define AD9959_RESET_Pin GPIO_PIN_4
#define AD9959_RESET_GPIO_Port GPIOB
#define FS2_PWM_Pin GPIO_PIN_6
#define FS2_PWM_GPIO_Port GPIOB
#define PS2_PWM_Pin GPIO_PIN_7
#define PS2_PWM_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
